eNum_1_0_1_1/InformationRegisters/ун30_ОбъектыНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ОбъектыНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантНумерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перезаписывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/InformationRegisters/ун30_ПравилаНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ПравилаНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ун30_НастройкиНумерации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/InformationRegisters/ун30_ТекущиеНомераДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ТекущиеНомераДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/InformationRegisters/ун30_ПрефиксыРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ПрефиксыРеквизитов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/CommonModules/ун30_ОбработчикиПодписокНаСобытия/Ext/Module.bsl
Процедура ун30_ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ Константы.ун30_Включить.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	имяМД = Источник.Метаданные().Имя;
	
	БазовыеНастройки = РегистрыСведений.ун30_ОбъектыНумерации.БазовыеНастройки(имяМД);
	БазовыеНастройки.Вставить("ДатаИсточника", Источник.Дата);
	
	Если БазовыеНастройки.Включить Тогда
		
		Если БазовыеНастройки.Перезаписывать Тогда
			Правила = РегистрыСведений.ун30_ПравилаНумерации.ПравилаНумерации(имяМД);
			
			НовыйНомер = ПолучитьНомерПоПравилам(Правила, БазовыеНастройки, Источник);
			
			Источник.Номер = НовыйНомер;
			
			Данные = Новый Структура;
			Данные.Вставить("ИмяДокумента", имяМД);
			Данные.Вставить("Номер", НовыйНомер);
			Данные.Вставить("Дата", Источник.Дата);
			
			РегистрыСведений.ун30_ТекущиеНомераДокументов.ЗаписатьНомерДокумента(Данные);
			РегистрыСведений.ун30_ТекущиеНомераДокументов.УвеличитьПорядковыйНомерДокумента(БазовыеНастройки);
			РегистрыСведений.ун30_ТекущиеНомераДокументов.ОбновитьСчетчик(Данные)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНомерПоПравилам(Правила, БазовыеНастройки, Источник)
	
	Результат = "";
	
	Если БазовыеНастройки.ВариантНумерации = 1 Тогда
		Результат = ПолучитьНомерФорматаДатыПоПравилам(Правила, БазовыеНастройки, Источник);
	ИначеЕсли БазовыеНастройки.ВариантНумерации = 2 Тогда
		Результат = ПолучитьНомерПоРеквизитуПоПравилам(Правила, БазовыеНастройки, Источник);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерФорматаДатыПоПравилам(Правила, БазовыеНастройки, Источник)
	
	Результат = "";
	
	НастройкиФорматаДаты = ун30_Сервер.ПолучитьНастройкиФорматаДаты(Правила.ФорматДаты);
	
	Результат = ун30_Сервер.СформироватьПримерНомераПоДате(НастройкиФорматаДаты, БазовыеНастройки);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерПоРеквизитуПоПравилам(Правила, БазовыеНастройки, Источник)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ПрефиксыРеквизитов.Префикс КАК Префикс
	|ИЗ
	|	РегистрСведений.ун30_ПрефиксыРеквизитов КАК ун30_ПрефиксыРеквизитов
	|ГДЕ
	|	ун30_ПрефиксыРеквизитов.ИмяДокумента = &ИмяДокумента
	|	И ун30_ПрефиксыРеквизитов.ИмяРеквизита = &ИмяРеквизита
	|	И ун30_ПрефиксыРеквизитов.ЗначениеРеквизита = &ЗначениеРеквизита";
	Запрос.УстановитьПараметр("ИмяДокумента", БазовыеНастройки.ИмяДокумента);
	Запрос.УстановитьПараметр("ИмяРеквизита", Правила.ИмяРеквизита);
	Запрос.УстановитьПараметр("ЗначениеРеквизита", Источник[Правила.ИмяРеквизита]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Префикс = Выборка.Префикс;
	КонецЦикла;
	
	
	Возврат Результат;
	
	
	
КонецФункции
